app/views/messages/_main_chat.html.haml

SELECT `users`.* FROM `users` WHERE `users`.`id` = 6
---
        %li.contents__top__group-member-list
          - @group.group_users.each do |group_user|= group_user.user.name
    .contents__top__edit-btn