app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)
    if @group.save
---
INSERT INTO `groups` (`name`, `created_at`, `updated_at`) VALUES ('アイウエオ', '2020-02-26 08:22:33', '2020-02-26 08:22:33')

  def set_group
    @group = Group.find(params[:id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1