app/controllers/messages_controller.rb

  def index
    @message = Message.new
    @message = @group.messages.includes(:user)
---
SELECT  `messages`.* FROM `messages` WHERE `messages`.`group_id` = 1 ORDER BY `messages`.`id` DESC LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (9, 10)

  def create
    @message = @group.messages.new(message_params)
    if @message.save
---
INSERT INTO `messages` (`content`, `image`, `group_id`, `user_id`, `created_at`, `updated_at`) VALUES ('', 'Laker_shorts2.JPG', 5, 7, '2020-03-04 12:10:57', '2020-03-04 12:10:57')

  def set_group
    @group = Group.find(params[:group_id])
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 7 LIMIT 1