app/controllers/users_controller.rb

  def update
    if current_user.update(user_params)
---
UPDATE `users` SET `name` = 'ry', `updated_at` = '2020-02-28 06:31:29' WHERE `users`.`id` = 6